#字符串 --------->不可变性，有序性，可迭代性

s = "hello-Python"

print(s[4])#取出一个，有序性
print(s[-8])#逆序

for i in s:
    print(i)

#不可变性：s[0] = o  --- X
# 切片 - 同链表
print(s[0:5:1])
print(s[:5:1])
print(s[:5:])
print(s[:5])
print("---------------------")

#步长要和遍历方向相同，逆序可以实现字符串反转
print(s[-1:-7:-1])
print(s[::-1])

#-----------------------------------------------------

#字符串操作常用方法,均不改变原字符串
"""
find() - 在字符串中查找子串，返回第一次出现的结果，找不到返回-1
count() - 统计子串在字符串中出现的次数
upper() - 将字符串中的所有字母转换为大写
lower() - 将字符串中的所有字母转换为小写
split() - 将字符串按指定分隔符分割成列表
strip() -去除字符串两端的空白字符或指定字符
relace() - 将字符串中的指定子串替换为新的子串
startswith() - 检查字符串是以指定子串开头，返回bool
endswith() - 检查字符串是以指定子串结束，返回bool
"""

#------------------------------------

#案例1 - 邮箱格式
#法一
# mail = input("请输入邮箱：")
#
# if mail.count("@") == 1 and mail.find(".") >= 1:
#     print(f"{mail}是一个合法的邮箱！")
# else:
#     print(f"{mail}不是一个合法的邮箱!")
# #法二
# #  in  用于判断指定的子字符串是否出现在字符串中，返回bool
# if mail.count("@") == 1 and "." in mail:
#     print(f"{mail}是一个合法的邮箱!")
# else:
#     print(f"{mail}不是一个合法的邮箱！")

#练习1：判断回文字符串
#法一：遍历一半，运行速度更快---------------------------------
s1 = "上海自来水来自海下"
#print(len(s1))
a = (len(s1) + 1) // 2#判断一半即可
s2 = s1[::-1]#反转
for i in range(0,a):
    if s1[i] != s2[i]:
        print(f"\"{s1}\"不是回文字符串")#也可以直接打中文引号
        break
else:
    print(f"\"{s1}\"是回文字符串")
#法二：暴力解----------------------------------------------------
s1 = "上海自来水来自海下"
if s1 == s1[::-1]:
    print(f"\"{s1}\"是回文字符串")
else:
    print(f"\"{s1}\"不是回文字符串")
#法三：双指针-节约空间--------------------------------------------------
s1 = "上海自来水来自海下"
left = 0
right = len(s1)-1
flag = True
while left < right:
    if s1[left] != s1[right]:
        flag = False
        break
    left += 1
    right -= 1
if flag:
    print(f"\"{s1}\"是回文字符串")
else:
    print(f"\"{s1}\"不是回文字符串")